MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX775F512L.atdf
      <value-group caption="Extended Identifier Enable bits" name="C2RXF17__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier bits" name="C2RXF17__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXF18__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C1RXF18__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXF18__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier bits" name="C2RXF18__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C2RXF18__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier bits" name="C2RXF18__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXF19__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C1RXF19__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXF19__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier bits" name="C2RXF19__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C2RXF19__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier bits" name="C2RXF19__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXF20__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C1RXF20__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXF20__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier bits" name="C2RXF20__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C2RXF20__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier bits" name="C2RXF20__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier bits" name="C1RXF21__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C1RXF21__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXF21__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier bits" name="C2RXF21__EID">
         <value caption="Message address bit EIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit EIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bits" name="C2RXF21__EXID">
         <value caption="Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier bits" name="C2RXF21__SID">
         <value caption="Message address bit SIDx must be 1 to match filter" name="" value="0x1" />
         <value caption="Message address bit SIDx must be 0 to match filter" name="" value="0x0" />
      </value-group>
