MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX775F512L.atdf
      <value-group caption="Receive FIFO Half Full Interrupt Flag bit" name="C2FIFOINT31__RXHALFIF">
         <value caption="(TXEN is 1) Unused, reads 0 / (TXEN is 0) FIFO is not empty, has at least 1 message" name="" value="0x1" />
         <value caption="(TXEN is 1) Unused, reads 0 / (TXEN is 0) FIFO is empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive FIFO Full Interrupt Flag bit" name="C2FIFOINT31__RXFULLIF">
         <value caption="(TXEN is 1) Unused, reads 0 / (TXEN is 0) FIFO is full" name="" value="0x1" />
         <value caption="(TXEN is 1) Unused, reads 0 / (TXEN is 0) FIFO is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive FIFO Overflow Interrupt Flag bit" name="C2FIFOINT31__RXOVFLIF">
         <value caption="(TXEN is 1) Unused, reads 0 / (TXEN is 0) Overflow event has occurred" name="" value="0x1" />
         <value caption="(TXEN is 1) Unused, reads 0 / (TXEN is 0) Overflow event has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO Empty Interrupt Flag bit" name="C2FIFOINT31__TXEMPTYIF">
         <value caption="(TXEN is 1) FIFO is empty / (TXEN is 0) Unused, reads 0" name="" value="0x1" />
         <value caption="(TXEN is 1) FIFO is not empty / (TXEN is 0) Unused, reads 0" name="" value="0x0" />
      </value-group>
      <value-group caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit" name="C2FIFOINT31__TXHALFIF">
         <value caption="(TXEN is 1) FIFO is at most half full / (TXEN is 0) Unused, reads 0" name="" value="0x1" />
         <value caption="(TXEN is 1) FIFO is more than half full / (TXEN is 0) Unused, reads 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO Not Full Interrupt Flag bit" name="C2FIFOINT31__TXNFULLIF">
         <value caption="(TXEN is 1) FIFO is not full / (TXEN is 0) Unused, reads 0" name="" value="0x1" />
         <value caption="(TXEN is 1) FIFO is full / (TXEN is 0) Unused, reads 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Empty Interrupt Enable bit" name="C2FIFOINT31__RXNEMPTYIE">
         <value caption="Interrupt enabled for FIFO not empty" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO not empty" name="" value="0x0" />
      </value-group>
      <value-group caption="FIFO Half Full Interrupt Enable bit" name="C2FIFOINT31__RXHALFIE">
         <value caption="Interrupt enabled for FIFO half full" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO half full" name="" value="0x0" />
      </value-group>
      <value-group caption="Full Interrupt Enable bit" name="C2FIFOINT31__RXFULLIE">
         <value caption="Interrupt enabled for FIFO full" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO full" name="" value="0x0" />
      </value-group>
      <value-group caption="Overflow Interrupt Enable bit" name="C2FIFOINT31__RXOVFLIE">
         <value caption="Interrupt enabled for overflow event" name="" value="0x1" />
         <value caption="Interrupt disabled for overflow event" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO Empty Interrupt Enable bit" name="C2FIFOINT31__TXEMPTYIE">
         <value caption="Interrupt enabled for FIFO empty" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO Half Full Interrupt Enable bit" name="C2FIFOINT31__TXHALFIE">
         <value caption="Interrupt enabled for FIFO half full" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO half full" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit FIFO Not Full Interrupt Enable bit" name="C2FIFOINT31__TXNFULLIE">
         <value caption="Interrupt enabled for FIFO not full" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO not full" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01166" name="CFG" version="">
      <register-group name="CFG">
         <register caption="" name="DDPCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="TDO Enable for 2-Wire JTAG" mask="0x00000001" name="TDOEN" values="DDPCON__TDOEN" />
            <bitfield caption="Trace Output Enable bit" mask="0x00000004" name="TROEN" values="DDPCON__TROEN" />
            <bitfield caption="JTAG Port Enable bit" mask="0x00000008" name="JTAGEN" values="DDPCON__JTAGEN" />
         </register>
         <register caption="" name="DEVID" offset="0x20" rw="R" size="4">
            <bitfield mask="0x0FFFFFFF" name="DEVID" />
            <bitfield mask="0xF0000000" name="VER" />
         </register>
         <register caption="" name="SYSKEY" offset="0x30" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="SYSKEY" />
         </register>
      </register-group>
      <value-group caption="TDO Enable for 2-Wire JTAG" name="DDPCON__TDOEN">
         <value caption="2-wire JTAG protocol uses TDO" name="" value="0x1" />
         <value caption="2-wire JTAG protocol does not use TDO" name="" value="0x0" />
      </value-group>
      <value-group caption="Trace Output Enable bit" name="DDPCON__TROEN">
         <value caption="Enable trace outputs and start trace clock (trace probe must be present)" name="" value="0x1" />
         <value caption="Disable trace outputs and stop trace clock" name="" value="0x0" />
      </value-group>
      <value-group caption="JTAG Port Enable bit" name="DDPCON__JTAGEN">
         <value caption="Enable the JTAG port" name="" value="0x1" />
         <value caption="Disable the JTAG port" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00866" name="CMP" version="2">
      <register-group name="CMP">
         <register caption="Comparator Control Register" name="CM1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Comparator Negative Input Select bits for Comparator" mask="0x00000003" name="CCH" values="CM1CON__CCH" />
            <bitfield caption="Comparator Positive Input Configure bit" mask="0x00000010" name="CREF" values="CM1CON__CREF" />
            <bitfield caption="Interrupt Event Polarity Select bits" mask="0x000000C0" name="EVPOL" values="CM1CON__EVPOL" />
            <bitfield caption="Comparator Output bit" mask="0x00000100" name="COUT" values="CM1CON__COUT" />
            <bitfield caption="Comparator Output Inversion bit" mask="0x00002000" name="CPOL" values="CM1CON__CPOL" />
            <bitfield caption="Comparator Output Enable bit" mask="0x00004000" name="COE" values="CM1CON__COE" />
            <bitfield caption="Comparator ON bit" mask="0x00008000" name="ON" values="CM1CON__ON" />
         </register>
         <register caption="Comparator Control Register" name="CM2CON" offset="0x10" rw="RW" size="4">
            <bitfield caption="Comparator Negative Input Select bits for Comparator" mask="0x00000003" name="CCH" values="CM2CON__CCH" />
            <bitfield caption="Comparator Positive Input Configure bit" mask="0x00000010" name="CREF" values="CM2CON__CREF" />
            <bitfield caption="Interrupt Event Polarity Select bits" mask="0x000000C0" name="EVPOL" values="CM2CON__EVPOL" />
            <bitfield caption="Comparator Output bit" mask="0x00000100" name="COUT" values="CM2CON__COUT" />
            <bitfield caption="Comparator Output Inversion bit" mask="0x00002000" name="CPOL" values="CM2CON__CPOL" />
            <bitfield caption="Comparator Output Enable bit" mask="0x00004000" name="COE" values="CM2CON__COE" />
            <bitfield caption="Comparator ON bit" mask="0x00008000" name="ON" values="CM2CON__ON" />
         </register>
         <register caption="Comparator Status Register" name="CMSTAT" offset="0x60" rw="RW" size="4">
            <bitfield caption="Comparator Output bit" mask="0x00000001" name="C1OUT" values="CMSTAT__C1OUT" />
            <bitfield caption="Comparator Output bit" mask="0x00000002" name="C2OUT" values="CMSTAT__C2OUT" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="CMSTAT__SIDL" />
         </register>
      </register-group>
      <value-group caption="Comparator Negative Input Select bits for Comparator" name="CM1CON__CCH">
         <value caption="Comparator inverting input is connected to the IVREF" name="" value="0x3" />
         <value caption="Comparator inverting input is connected to the C2IN+ pin" name="" value="0x2" />
         <value caption="Comparator inverting input is connected to the C1IN+ pin" name="" value="0x1" />
         <value caption="Comparator inverting input is connected to the C1IN- pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Positive Input Configure bit" name="CM1CON__CREF">
         <value caption="Comparator non-inverting input is connected to the internal CVREF" name="" value="0x1" />
         <value caption="Comparator non-inverting input is connected to the C1IN+ pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt Event Polarity Select bits" name="CM1CON__EVPOL">
         <value caption="Comparator interrupt is generated on a low-to-high or high-to-low transition of the comparator output" name="" value="0x3" />
         <value caption="Comparator interrupt is generated on a high-to-low transition of the comparator output" name="" value="0x2" />
         <value caption="Comparator interrupt is generated on a low-to-high transition of the comparator output" name="" value="0x1" />
         <value caption="Comparator interrupt generation is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output bit" name="CM1CON__COUT">
         <value caption="Output of the Comparator is a 1" name="" value="0x1" />
         <value caption="Output of the Comparator is a 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Inversion bit" name="CM1CON__CPOL">
         <value caption="Output is inverted" name="" value="0x1" />
         <value caption="Output is not inverted" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator Output Enable bit" name="CM1CON__COE">
         <value caption="Comparator output is driven on the output CxOUT pin" name="" value="0x1" />
         <value caption="Comparator output is not driven on the output CxOUT pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator ON bit" name="CM1CON__ON">
         <value caption="Module is enabled. Setting this bit does not affect the other bits in this register" name="" value="0x1" />
         <value caption="Module is disabled and does not consume current. Clearing this bit does not affect the other bits in this register" name="" value="0x0" />
      </value-group>
