MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX775F512L.atdf
      <value-group caption="Channel Destination Pointer bits" name="DCH2DPTR__CHDPTR">
         <value caption="Points to byte 65535 of the destination" name="" value="0xffff" />
         <value caption="Points to byte 1 of the destination" name="" value="0x1" />
         <value caption="Points to byte 0 of the destination" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Pointer bits" name="DCH3DPTR__CHDPTR">
         <value caption="Points to byte 65535 of the destination" name="" value="0xffff" />
         <value caption="Points to byte 1 of the destination" name="" value="0x1" />
         <value caption="Points to byte 0 of the destination" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Pointer bits" name="DCH4DPTR__CHDPTR">
         <value caption="Points to byte 65535 of the destination" name="" value="0xffff" />
         <value caption="Points to byte 1 of the destination" name="" value="0x1" />
         <value caption="Points to byte 0 of the destination" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Pointer bits" name="DCH5DPTR__CHDPTR">
         <value caption="Points to byte 65535 of the destination" name="" value="0xffff" />
         <value caption="Points to byte 1 of the destination" name="" value="0x1" />
         <value caption="Points to byte 0 of the destination" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Pointer bits" name="DCH6DPTR__CHDPTR">
         <value caption="Points to byte 65535 of the destination" name="" value="0xffff" />
         <value caption="Points to byte 1 of the destination" name="" value="0x1" />
         <value caption="Points to byte 0 of the destination" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Destination Pointer bits" name="DCH7DPTR__CHDPTR">
         <value caption="Points to byte 65535 of the destination" name="" value="0xffff" />
         <value caption="Points to byte 1 of the destination" name="" value="0x1" />
         <value caption="Points to byte 0 of the destination" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell-Size bits" name="DCH0CSIZ__CHCSIZ">
         <value caption="65535 bytes transferred on an event" name="" value="0xffff" />
         <value caption="2 bytes transferred on an event" name="" value="0x2" />
         <value caption="1 byte transferred on an event" name="" value="0x0" />
         <value caption="" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell-Size bits" name="DCH1CSIZ__CHCSIZ">
         <value caption="65535 bytes transferred on an event" name="" value="0xffff" />
         <value caption="2 bytes transferred on an event" name="" value="0x2" />
         <value caption="1 byte transferred on an event" name="" value="0x0" />
         <value caption="" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell-Size bits" name="DCH2CSIZ__CHCSIZ">
         <value caption="65535 bytes transferred on an event" name="" value="0xffff" />
         <value caption="2 bytes transferred on an event" name="" value="0x2" />
         <value caption="1 byte transferred on an event" name="" value="0x0" />
         <value caption="" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell-Size bits" name="DCH3CSIZ__CHCSIZ">
         <value caption="65535 bytes transferred on an event" name="" value="0xffff" />
         <value caption="2 bytes transferred on an event" name="" value="0x2" />
         <value caption="1 byte transferred on an event" name="" value="0x0" />
         <value caption="" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell-Size bits" name="DCH4CSIZ__CHCSIZ">
         <value caption="65535 bytes transferred on an event" name="" value="0xffff" />
         <value caption="2 bytes transferred on an event" name="" value="0x2" />
         <value caption="1 byte transferred on an event" name="" value="0x0" />
         <value caption="" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell-Size bits" name="DCH5CSIZ__CHCSIZ">
         <value caption="65535 bytes transferred on an event" name="" value="0xffff" />
         <value caption="2 bytes transferred on an event" name="" value="0x2" />
         <value caption="1 byte transferred on an event" name="" value="0x0" />
         <value caption="" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell-Size bits" name="DCH6CSIZ__CHCSIZ">
         <value caption="65535 bytes transferred on an event" name="" value="0xffff" />
         <value caption="2 bytes transferred on an event" name="" value="0x2" />
         <value caption="1 byte transferred on an event" name="" value="0x0" />
         <value caption="" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell-Size bits" name="DCH7CSIZ__CHCSIZ">
         <value caption="65535 bytes transferred on an event" name="" value="0xffff" />
         <value caption="2 bytes transferred on an event" name="" value="0x2" />
         <value caption="1 byte transferred on an event" name="" value="0x0" />
         <value caption="" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell Progress Pointer bits" name="DCH0CPTR__CHCPTR">
         <value caption="65535 bytes have been transferred since the last event" name="" value="0xffff" />
         <value caption="1 byte has been transferred since the last event" name="" value="0x1" />
         <value caption="0 bytes have been transferred since the last event" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell Progress Pointer bits" name="DCH1CPTR__CHCPTR">
         <value caption="65535 bytes have been transferred since the last event" name="" value="0xffff" />
         <value caption="1 byte has been transferred since the last event" name="" value="0x1" />
         <value caption="0 bytes have been transferred since the last event" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell Progress Pointer bits" name="DCH2CPTR__CHCPTR">
         <value caption="65535 bytes have been transferred since the last event" name="" value="0xffff" />
         <value caption="1 byte has been transferred since the last event" name="" value="0x1" />
         <value caption="0 bytes have been transferred since the last event" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell Progress Pointer bits" name="DCH3CPTR__CHCPTR">
         <value caption="65535 bytes have been transferred since the last event" name="" value="0xffff" />
         <value caption="1 byte has been transferred since the last event" name="" value="0x1" />
         <value caption="0 bytes have been transferred since the last event" name="" value="0x0" />
      </value-group>
