MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX775F512L.atdf
      <value-group caption="Channel Cell Progress Pointer bits" name="DCH4CPTR__CHCPTR">
         <value caption="65535 bytes have been transferred since the last event" name="" value="0xffff" />
         <value caption="1 byte has been transferred since the last event" name="" value="0x1" />
         <value caption="0 bytes have been transferred since the last event" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell Progress Pointer bits" name="DCH5CPTR__CHCPTR">
         <value caption="65535 bytes have been transferred since the last event" name="" value="0xffff" />
         <value caption="1 byte has been transferred since the last event" name="" value="0x1" />
         <value caption="0 bytes have been transferred since the last event" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell Progress Pointer bits" name="DCH6CPTR__CHCPTR">
         <value caption="65535 bytes have been transferred since the last event" name="" value="0xffff" />
         <value caption="1 byte has been transferred since the last event" name="" value="0x1" />
         <value caption="0 bytes have been transferred since the last event" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Cell Progress Pointer bits" name="DCH7CPTR__CHCPTR">
         <value caption="65535 bytes have been transferred since the last event" name="" value="0xffff" />
         <value caption="1 byte has been transferred since the last event" name="" value="0x1" />
         <value caption="0 bytes have been transferred since the last event" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01114" name="ETH" version="1">
      <register-group name="ETH">
         <register caption="Ethernet Controller Control Register 1" name="ETHCON1" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="BUFCDEC" />
            <bitfield caption="Manual Flow Control bit" mask="0x00000010" name="MANFC" values="ETHCON1__MANFC" />
            <bitfield caption="Automatic Flow Control bit" mask="0x00000080" name="AUTOFC" values="ETHCON1__AUTOFC" />
            <bitfield caption="Receive Enable bit" mask="0x00000100" name="RXEN" values="ETHCON1__RXEN" />
            <bitfield caption="Transmit Request to Send bit" mask="0x00000200" name="TXRTS" values="ETHCON1__TXRTS" />
            <bitfield caption="Ethernet Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="ETHCON1__SIDL" />
            <bitfield caption="Ethernet ON bit" mask="0x00008000" name="ON" values="ETHCON1__ON" />
            <bitfield mask="0xFFFF0000" name="PTV" />
         </register>
         <register caption="Ethernet Controller Control Register 2" name="ETHCON2" offset="0x10" rw="RW" size="4">
            <bitfield caption="RX Data Buffer Size for All RX Descriptors bits" mask="0x000007F0" name="RXBUFSZ" values="ETHCON2__RXBUFSZ" />
         </register>
         <register caption="Ethernet Controller TX Packet Descriptor Start Address Register" name="ETHTXST" offset="0x20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFC" name="TXSTADDR" />
         </register>
         <register caption="Ethernet Controller RX Packet Descriptor Start Address Register" name="ETHRXST" offset="0x30" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFC" name="RXSTADDR" />
         </register>
         <register caption="Ethernet Controller Hash Table 0 Register" name="ETHHT0" offset="0x40" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="HT" />
         </register>
         <register caption="Ethernet Controller Hash Table 1 Register" name="ETHHT1" offset="0x50" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="HT" />
         </register>
         <register caption="Ethernet Controller Pattern Match Mask 0 Register" name="ETHPMM0" offset="0x60" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="PMM" />
         </register>
         <register caption="Ethernet Controller Pattern Match Mask 1 Register" name="ETHPMM1" offset="0x70" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="PMM" />
         </register>
         <register caption="Ethernet Controller Pattern Match Checksum Register" name="ETHPMCS" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PMCS" />
         </register>
         <register caption="Ethernet Controller Pattern Match Offset Register" name="ETHPMO" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PMO" />
         </register>
         <register caption="Ethernet Controller Receive Filter Configuration Register" name="ETHRXFC" offset="0xa0" rw="RW" size="4">
            <bitfield caption="Broadcast Enable bit" mask="0x00000001" name="BCEN" values="ETHRXFC__BCEN" />
            <bitfield caption="Multicast Enable bit" mask="0x00000002" name="MCEN" values="ETHRXFC__MCEN" />
            <bitfield caption="Not Me Unicast Enable bit" mask="0x00000004" name="NOTMEEN" values="ETHRXFC__NOTMEEN" />
            <bitfield caption="Unicast Enable bit" mask="0x00000008" name="UCEN" values="ETHRXFC__UCEN" />
            <bitfield caption="Runt Enable bit" mask="0x00000010" name="RUNTEN" values="ETHRXFC__RUNTEN" />
            <bitfield caption="Runt Error Collection Enable bit" mask="0x00000020" name="RUNTERREN" values="ETHRXFC__RUNTERREN" />
            <bitfield caption="CRC OK Enable bit" mask="0x00000040" name="CRCOKEN" values="ETHRXFC__CRCOKEN" />
            <bitfield caption="CRC Error Collection Enable bit" mask="0x00000080" name="CRCERREN" values="ETHRXFC__CRCERREN" />
            <bitfield caption="Pattern Match Mode bits" mask="0x00000F00" name="PMMODE" values="ETHRXFC__PMMODE" />
            <bitfield caption="Pattern Match Inversion bit" mask="0x00001000" name="NOTPM" values="ETHRXFC__NOTPM" />
            <bitfield caption="Magic Packet Enable bit" mask="0x00004000" name="MPEN" values="ETHRXFC__MPEN" />
            <bitfield caption="Enable Hash Table Filtering bit" mask="0x00008000" name="HTEN" values="ETHRXFC__HTEN" />
         </register>
