MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX775F512L.atdf
         <register caption="Ethernet Controller Receive Watermarks Register" name="ETHRXWM" offset="0xb0" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="RXEWM" />
            <bitfield mask="0x00FF0000" name="RXFWM" />
         </register>
         <register caption="Ethernet Controller Interrupt Enable Register" name="ETHIEN" offset="0xc0" rw="RW" size="4">
            <bitfield caption="Receive FIFO Overflow Interrupt Enable bit" mask="0x00000001" name="RXOVFLWIE" values="ETHIEN__RXOVFLWIE" />
            <bitfield caption="Receive Buffer Not Available Interrupt Enable bit" mask="0x00000002" name="RXBUFNAIE" values="ETHIEN__RXBUFNAIE" />
            <bitfield caption="Transmitter Abort Interrupt Enable bit" mask="0x00000004" name="TXABORTIE" values="ETHIEN__TXABORTIE" />
            <bitfield caption="Transmitter Done Interrupt Enable bit" mask="0x00000008" name="TXDONEIE" values="ETHIEN__TXDONEIE" />
            <bitfield caption="RX Activity Interrupt Enable bit" mask="0x00000020" name="RXACTIE" values="ETHIEN__RXACTIE" />
            <bitfield caption="Packet Pending Interrupt Enable bit" mask="0x00000040" name="PKTPENDIE" values="ETHIEN__PKTPENDIE" />
            <bitfield caption="Receiver Done Interrupt Enable bit" mask="0x00000080" name="RXDONEIE" values="ETHIEN__RXDONEIE" />
            <bitfield caption="Full Watermark Interrupt Enable bit" mask="0x00000100" name="FWMARKIE" values="ETHIEN__FWMARKIE" />
            <bitfield caption="Empty Watermark Interrupt Enable bit" mask="0x00000200" name="EWMARKIE" values="ETHIEN__EWMARKIE" />
            <bitfield caption="Receive BVCI Bus Error Interrupt Enable bit" mask="0x00002000" name="RXBUSEIE" values="ETHIEN__RXBUSEIE" />
            <bitfield caption="Transmit BVCI Bus Error Interrupt Enable bit" mask="0x00004000" name="TXBUSEIE" values="ETHIEN__TXBUSEIE" />
         </register>
         <register caption="Ethernet Controller Interrupt Request Register" name="ETHIRQ" offset="0xd0" rw="RW" size="4">
            <bitfield caption="Receive FIFO Over Flow Error bit" mask="0x00000001" name="RXOVFLW" values="ETHIRQ__RXOVFLW" />
            <bitfield caption="Receive Buffer Not Available Interrupt bit" mask="0x00000002" name="RXBUFNA" values="ETHIRQ__RXBUFNA" />
            <bitfield caption="Transmit Abort Condition Interrupt bit" mask="0x00000004" name="TXABORT" values="ETHIRQ__TXABORT" />
            <bitfield caption="Transmit Done Interrupt bit" mask="0x00000008" name="TXDONE" values="ETHIRQ__TXDONE" />
            <bitfield caption="Receive Activity Interrupt bit" mask="0x00000020" name="RXACT" values="ETHIRQ__RXACT" />
            <bitfield caption="Packet Pending Interrupt bit" mask="0x00000040" name="PKTPEND" values="ETHIRQ__PKTPEND" />
            <bitfield caption="Receive Done Interrupt bit" mask="0x00000080" name="RXDONE" values="ETHIRQ__RXDONE" />
            <bitfield caption="Full Watermark Interrupt bit" mask="0x00000100" name="FWMARK" values="ETHIRQ__FWMARK" />
            <bitfield caption="Empty Watermark Interrupt bit" mask="0x00000200" name="EWMARK" values="ETHIRQ__EWMARK" />
            <bitfield caption="Receive BVCI Bus Error Interrupt bit" mask="0x00002000" name="RXBUSE" values="ETHIRQ__RXBUSE" />
            <bitfield caption="Transmit BVCI Bus Error Interrupt bit" mask="0x00004000" name="TXBUSE" values="ETHIRQ__TXBUSE" />
         </register>
         <register caption="Ethernet Controller Status Register" name="ETHSTAT" offset="0xe0" rw="RW" size="4">
            <bitfield caption="Receive Busy bit" mask="0x00000020" name="RXBUSY" values="ETHSTAT__RXBUSY" />
            <bitfield caption="Transmit Busy bit" mask="0x00000040" name="TXBUSY" values="ETHSTAT__TXBUSY" />
            <bitfield mask="0x00000080" name="BUSY" />
            <bitfield mask="0x00FF0000" name="BUFCNT" />
         </register>
         <register caption="Ethernet Controller Receive Overflow Statistics Register" name="ETHRXOVFLOW" offset="0x100" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="RXOVFLWCNT" />
         </register>
         <register caption="Ethernet Controller Frames Transmitted OK Statistics Register" name="ETHFRMTXOK" offset="0x110" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="FRMTXOKCNT" />
         </register>
         <register caption="Ethernet Controller Single Collision Frames Statistics Register" name="ETHSCOLFRM" offset="0x120" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="SCOLFRMCNT" />
         </register>
         <register caption="Ethernet Controller Multiple Collision Frames Statistics Register" name="ETHMCOLFRM" offset="0x130" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="MCOLFRMCNT" />
         </register>
         <register caption="Ethernet Controller Frames Received OK Statistics Register" name="ETHFRMRXOK" offset="0x140" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="FRMRXOKCNT" />
         </register>
         <register caption="Ethernet Controller Frame Check Sequence Error Statistics Register" name="ETHFCSERR" offset="0x150" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="FCSERRCNT" />
         </register>
         <register caption="Ethernet Controller Alignment Errors Statistics Register" name="ETHALGNERR" offset="0x160" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="ALGNERRCNT" />
         </register>
         <register caption="Ethernet Controller MAC Configuration 1 Register" name="EMAC1CFG1" offset="0x200" rw="RW" size="4">
            <bitfield caption="MAC Receive Enable bit" mask="0x00000001" name="RXENABLE" values="EMAC1CFG1__RXENABLE" />
            <bitfield caption="MAC Pass all Receive Frames bit" mask="0x00000002" name="PASSALL" values="EMAC1CFG1__PASSALL" />
            <bitfield caption="MAC RX Flow Control bit" mask="0x00000004" name="RXPAUSE" values="EMAC1CFG1__RXPAUSE" />
            <bitfield caption="MAC TX Flow Control bit" mask="0x00000008" name="TXPAUSE" values="EMAC1CFG1__TXPAUSE" />
            <bitfield caption="MAC Loopback mode bit" mask="0x00000010" name="LOOPBACK" values="EMAC1CFG1__LOOPBACK" />
            <bitfield mask="0x00000100" name="RESETTFUN" />
            <bitfield mask="0x00000200" name="RESETTMCS" />
            <bitfield mask="0x00000400" name="RESETRFUN" />
            <bitfield mask="0x00000800" name="RESETRMCS" />
            <bitfield mask="0x00004000" name="SIMRESET" />
            <bitfield mask="0x00008000" name="SOFTRESET" />
         </register>
         <register caption="Ethernet Controller MAC Configuration 2 Register" name="EMAC1CFG2" offset="0x210" rw="RW" size="4">
            <bitfield caption="Full-Duplex Operation bit" mask="0x00000001" name="FULLDPLX" values="EMAC1CFG2__FULLDPLX" />
            <bitfield caption="Frame Length checking bit" mask="0x00000002" name="LENGTHCK" values="EMAC1CFG2__LENGTHCK" />
            <bitfield caption="Huge Frame enable bit" mask="0x00000004" name="HUGEFRM" values="EMAC1CFG2__HUGEFRM" />
            <bitfield caption="Delayed CRC bit" mask="0x00000008" name="DELAYCRC" values="EMAC1CFG2__DELAYCRC" />
            <bitfield caption="CRC Enable1 bit" mask="0x00000010" name="CRCENABLE" values="EMAC1CFG2__CRCENABLE" />
            <bitfield caption="Pad/CRC Enable bit" mask="0x00000020" name="PADENABLE" values="EMAC1CFG2__PADENABLE" />
            <bitfield caption="VLAN Pad Enable bit" mask="0x00000040" name="VLANPAD" values="EMAC1CFG2__VLANPAD" />
            <bitfield caption="Automatic Detect Pad Enable bit" mask="0x00000080" name="AUTOPAD" values="EMAC1CFG2__AUTOPAD" />
            <bitfield caption="Pure Preamble Enforcement bit" mask="0x00000100" name="PUREPRE" values="EMAC1CFG2__PUREPRE" />
            <bitfield caption="Long Preamble Enforcement bit" mask="0x00000200" name="LONGPRE" values="EMAC1CFG2__LONGPRE" />
            <bitfield caption="No Backoff bit" mask="0x00001000" name="NOBKOFF" values="EMAC1CFG2__NOBKOFF" />
            <bitfield caption="Backpressure/No Backoff bit" mask="0x00002000" name="BPNOBKOFF" values="EMAC1CFG2__BPNOBKOFF" />
            <bitfield caption="Excess Defer bit" mask="0x00004000" name="EXCESSDER" values="EMAC1CFG2__EXCESSDER" />
         </register>
         <register caption="Ethernet Controller MAC Back-to-Back Interpacket Gap Register" name="EMAC1IPGT" offset="0x220" rw="RW" size="4">
            <bitfield mask="0x0000007F" name="B2BIPKTGP" />
         </register>
         <register caption="Ethernet Controller MAC Non-Back-to-Back Interpacket Gap Register" name="EMAC1IPGR" offset="0x230" rw="RW" size="4">
            <bitfield mask="0x0000007F" name="NB2BIPKTGP2" />
            <bitfield mask="0x00007F00" name="NB2BIPKTGP1" />
         </register>
