MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX775F512L.atdf
         <register caption="SPI Control Register" name="SPI1CON" offset="0x600" rw="RW" size="4">
            <bitfield caption="SPI Receive Buffer Full Interrupt Mode bits" mask="0x00000003" name="SRXISEL" values="SPI1CON__SRXISEL" />
            <bitfield caption="SPI Transmit Buffer Empty Interrupt Mode bits" mask="0x0000000C" name="STXISEL" values="SPI1CON__STXISEL" />
            <bitfield caption="Master Mode Enable bit" mask="0x00000020" name="MSTEN" values="SPI1CON__MSTEN" />
            <bitfield caption="Clock Polarity Select bit" mask="0x00000040" name="CKP" values="SPI1CON__CKP" />
            <bitfield caption="Slave Select Enable bit" mask="0x00000080" name="SSEN" values="SPI1CON__SSEN" />
            <bitfield caption="SPI Clock Edge Select bit" mask="0x00000100" name="CKE" values="SPI1CON__CKE" />
            <bitfield caption="SPI Data Input Sample Phase bit (master mode only)" mask="0x00000200" name="SMP" values="SPI1CON__SMP" />
            <bitfield caption="32/16-Bit Communication Select bits" mask="0x00000C00" name="MODE32" values="SPI1CON__MODE32" />
            <bitfield caption="Disable SDOx pin bit" mask="0x00001000" name="DISSDO" values="SPI1CON__DISSDO" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="SPI1CON__SIDL" />
            <bitfield caption="SPI Peripheral On bit" mask="0x00008000" name="ON" values="SPI1CON__ON" />
            <bitfield caption="Enhanced Buffer Enable bit" mask="0x00010000" name="ENHBUF" values="SPI1CON__ENHBUF" />
            <bitfield caption="Frame Sync Pulse Edge Select bit" mask="0x00020000" name="SPIFE" values="SPI1CON__SPIFE" />
            <bitfield caption="Frame Sync Pulse Counter bits. Controls the number of data characters transmitted per pulse. This bit is only valid in FRAMED_SYNC mode." mask="0x07000000" name="FRMCNT" values="SPI1CON__FRMCNT" />
            <bitfield caption="Frame Sync Pulse Width bit" mask="0x08000000" name="FRMSYPW" values="SPI1CON__FRMSYPW" />
            <bitfield caption="Master Mode Slave Select Enable bit" mask="0x10000000" name="MSSEN" values="SPI1CON__MSSEN" />
            <bitfield caption="Frame Sync Polarity bit (Framed SPI mode only)" mask="0x20000000" name="FRMPOL" values="SPI1CON__FRMPOL" />
            <bitfield caption="Frame Sync Pulse Direction Control on SSx pin bit (Framed SPI mode only)" mask="0x40000000" name="FRMSYNC" values="SPI1CON__FRMSYNC" />
            <bitfield caption="Framed SPI Support bit" mask="0x80000000" name="FRMEN" values="SPI1CON__FRMEN" />
         </register>
         <register caption="" name="SPI3STAT" offset="0x10" rw="R" size="4">
            <bitfield caption="SPI Receive Buffer Full Status bit" mask="0x00000001" name="SPIRBF" values="SPI3STAT__SPIRBF" />
            <bitfield caption="SPI Transmit Buffer Full Status bit" mask="0x00000002" name="SPITBF" values="SPI3STAT__SPITBF" />
            <bitfield caption="SPI Transmit Buffer Empty Status bit" mask="0x00000008" name="SPITBE" values="SPI3STAT__SPITBE" />
            <bitfield caption="RX FIFO Empty bit (valid only when ENHBUF = 1)" mask="0x00000020" name="SPIRBE" values="SPI3STAT__SPIRBE" />
            <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="SPIROV" values="SPI3STAT__SPIROV" />
            <bitfield caption="Shift Register Empty bit (valid only when ENHBUF = 1)" mask="0x00000080" name="SRMT" values="SPI3STAT__SRMT" />
            <bitfield caption="Transmit Under Run bit" mask="0x00000100" name="SPITUR" values="SPI3STAT__SPITUR" />
            <bitfield caption="SPI Activity Status bit" mask="0x00000800" name="SPIBUSY" values="SPI3STAT__SPIBUSY" />
            <bitfield mask="0x001F0000" name="TXBUFELM" />
            <bitfield mask="0x1F000000" name="RXBUFELM" />
         </register>
         <register caption="" name="SPI2STAT" offset="0x210" rw="R" size="4">
            <bitfield caption="SPI Receive Buffer Full Status bit" mask="0x00000001" name="SPIRBF" values="SPI2STAT__SPIRBF" />
            <bitfield caption="SPI Transmit Buffer Full Status bit" mask="0x00000002" name="SPITBF" values="SPI2STAT__SPITBF" />
            <bitfield caption="SPI Transmit Buffer Empty Status bit" mask="0x00000008" name="SPITBE" values="SPI2STAT__SPITBE" />
            <bitfield caption="RX FIFO Empty bit (valid only when ENHBUF = 1)" mask="0x00000020" name="SPIRBE" values="SPI2STAT__SPIRBE" />
            <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="SPIROV" values="SPI2STAT__SPIROV" />
            <bitfield caption="Shift Register Empty bit (valid only when ENHBUF = 1)" mask="0x00000080" name="SRMT" values="SPI2STAT__SRMT" />
            <bitfield caption="Transmit Under Run bit" mask="0x00000100" name="SPITUR" values="SPI2STAT__SPITUR" />
            <bitfield caption="SPI Activity Status bit" mask="0x00000800" name="SPIBUSY" values="SPI2STAT__SPIBUSY" />
            <bitfield mask="0x001F0000" name="TXBUFELM" />
            <bitfield mask="0x1F000000" name="RXBUFELM" />
         </register>
         <register caption="" name="SPI4STAT" offset="0x410" rw="R" size="4">
            <bitfield caption="SPI Receive Buffer Full Status bit" mask="0x00000001" name="SPIRBF" values="SPI4STAT__SPIRBF" />
            <bitfield caption="SPI Transmit Buffer Full Status bit" mask="0x00000002" name="SPITBF" values="SPI4STAT__SPITBF" />
            <bitfield caption="SPI Transmit Buffer Empty Status bit" mask="0x00000008" name="SPITBE" values="SPI4STAT__SPITBE" />
            <bitfield caption="RX FIFO Empty bit (valid only when ENHBUF = 1)" mask="0x00000020" name="SPIRBE" values="SPI4STAT__SPIRBE" />
            <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="SPIROV" values="SPI4STAT__SPIROV" />
            <bitfield caption="Shift Register Empty bit (valid only when ENHBUF = 1)" mask="0x00000080" name="SRMT" values="SPI4STAT__SRMT" />
            <bitfield caption="Transmit Under Run bit" mask="0x00000100" name="SPITUR" values="SPI4STAT__SPITUR" />
            <bitfield caption="SPI Activity Status bit" mask="0x00000800" name="SPIBUSY" values="SPI4STAT__SPIBUSY" />
            <bitfield mask="0x001F0000" name="TXBUFELM" />
            <bitfield mask="0x1F000000" name="RXBUFELM" />
         </register>
